Repository: JensUweB/ExamAdmin-Frontend
Catalog: src/locale/messages.*.xlf
Languages: de

# ngb.alert.close
source: Close
de: Schließen

# ngb.carousel.previous
source: Previous
de: Bisherige

# ngb.carousel.next
source: Next
de: Nächster

# ngb.datepicker.previous-month
source: Previous month
de: Vorheriger Monat

# ngb.datepicker.next-month
source: Next month
de: Nächsten Monat

# ngb.datepicker.select-month
source: Select month
de: Wähle einen Monat

# ngb.datepicker.select-year
source: Select year
de: Jahr auswählen

# ngb.pagination.first-aria
source: First
de: Zuerst

# ngb.pagination.previous-aria
source: Previous
de: Bisherige

# ngb.pagination.next-aria
source: Next
de: Nächster

# ngb.pagination.last-aria
source: Last
de: Letzte

# ngb.timepicker.increment-hours
source: Increment hours
de: Stunden erhöhen

# ngb.timepicker.hours
source: Hours
de: Stunden

# ngb.timepicker.decrement-hours
source: Decrement hours
de: Stunden verringern

# ngb.timepicker.increment-minutes
source: Increment minutes
de: Minuten erhöhen

# ngb.timepicker.minutes
source: Minutes
de: Minuten

# ngb.timepicker.decrement-minutes
source: Decrement minutes
de: Minuten verringern

# ngb.timepicker.increment-seconds
source: Increment seconds
de: Sekunden erhöhen

# ngb.timepicker.seconds
source: Seconds
de: Sekunden

# ngb.timepicker.decrement-seconds
source: Decrement seconds
de: Sekunden verringern

# ngb.toast.close-aria
source: Close
de: Schließen

source: Examination administration for martial arts clubs
de: Prüfungsverwaltung für Kampfsportvereine

source: Add Martial Art
de: Kampfkunst hinzufügen

source: Logout
de: Ausloggen

source: My Profile
de: Mein Profil

source: Personal data:
de: Persönliche Daten:

source: Your Martial Arts:
de: Deine Kampfkünste:

source: Exam Results:
de: Prüfungsergebnisse:

source: Martial Art
de: Kampfkunst

source: Rank
de: Rang

source: Date
de: Datum

source: Protocol
de: Protokoll

source: passed
de: bestanden

source: failed
de: gescheitert

source: Sorry, but you don't have any exam results yet!
de: Entschuldigung, aber du hast noch keine Prüfungsergebnisse!

source: Add a Martial Art
de: Fügen Sie eine Kampfkunst hinzu

source: Martial Arts
de: Kampfkunst

source: Exams
de: Prüfungen

source: Registration End Date:
de: Registrierungsenddatum:

source: Exam Date:
de: Prüfungsdatum:

source: Adress:
de: Anschrift:

source: Price:
de: Preis:

source: Add exam results
de: Prüfungsergebnisse hinzufügen

source: Choose exam:
de: Wähle eine Prüfung:

source: Choose participant:
de: Teilnehmer auswählen:

source: Has the user passed this exam?
de: Hat der Benutzer diese Prüfung bestanden?

source: Please choose the new rank of the user!
de: Bitte wählen Sie den neuen Rang des Benutzers!

source: Protocol upload - Please choose a file.
de: Protokoll-Upload - Bitte wählen Sie eine Datei.

source: Exam Details
de: Prüfungsdetails

source: Participants:
de: Teilnehmer:

source: no rank
de: kein Rang

source: No participants found.
de: Keine Teilnehmer gefunden.

source: Cancel
de: Abbrechen

source: Delete Exam
de: Prüfung löschen

source: Do you really want to delete this exam?
de: Möchten Sie diese Prüfung wirklich löschen?

source: Confirm Delete
de: Löschen bestätigen

source: Sorry, but you are not an examiner!
de: Entschuldigung, aber Sie sind kein Prüfer!

source: Create a new exam!
de: Erstelle eine neue Prüfung!

source: With the form below you can create a new exam!
de: Mit dem unten stehenden Formular können Sie eine neue Prüfung erstellen!

source: Create a new martial art
de: Erstellen Sie eine neue Kampfkunst

source: Ranks
de: Ränge

source: Delete Martial Art
de: Kampfkunst löschen

source: Do you really want to delete this martial art?
de: Möchten Sie diese Kampfkunst wirklich löschen?

source: Martial Art Details
de: Kampfkunst Details

source: Examiners:
de: Prüfer:

source: Martial Art Edit Mode
de: Kampfkunst-Bearbeitungsmodus

source: Add Examiner
de: Prüfer hinzufügen

source: Confirm
de: Bestätigen

source: <p><b>Welcome to our exam admin!</b><br/> What is this all about?<br/> This is a progressive web app for administrating martial arts exams. You can: <li>Create martial arts</li> <li>Create exams</li> <li>Create user accounts</li> <li>Users can register themselfs as participants for an existing exam</li> <li>Examiners can upload exam results and upload a protocol for each user</li></p>
de: <p><b>Willkommen zur Prüfungsverwaltung!</b><br/> Worum geht es hier? <br/> Dies ist eine Progressive Web App zur Verwaltung von Kampfkunst Prüfungen. Du kannst: <li>Kampfkünste erstellen</li> <li>Prüfungen erstellen</li> <li>Benutzerkonten anlegen</li> <li>Benutzer können sich zu Prüfungen anmelden</li> <li>Prüfer können Ergebnisse eintragen und Protokolle hochladen</li></p>

source: Your last name
de: Dein Nachname

source: Password
de: Passwort

source: Tell us, in a few words, what this exam is all about
de: Erzähle uns kurz, worum es in dieser Prüfung geht.

source: Put every important detail into here
de: Gib alle wichtigen Details hier ein!

source: The Address of the exam
de: Die Anschrift des Prüfungsortes

source: Tell us something about this martial art!
de: Erzähle uns etwas über diese Kampfkunst!

source: example@localhost.net
de: beispiel@localhost.net

source: your current password
de: Dein Aktuelles Passwort

source: new password
de: Neues Passwort

source: How many ranks do you want to add?
de: Wieviele Ränge möchtest du hinzufügen?

source: You can add as many ranks as you need.
de: Du kannst so viele Ränge hinzufügen wie du benötigst

source: No minimum rank
de: Kein Mindestrang

source: I'm sorry, but you do not have the required minimum rank.
de: Tut mir leid, aber du besitzest nicht den geforderten Mindestrang

source: Your first name
de: Dein Vorname

source: Please enter the email adress of an <b>existing</b> account to add as examiner:
de: Bitte gib die E-Mail Addresse eines <b>Existierenden</b> Accounts zum Hinzufügen als Prüfer ein:

source: <p><b>Hints:</b> Ranks are sortet from lowest to highest. You should stick to this order to avoid errors.<br/> You can rearrange items with drag and drop!</p>
de: <p><b>Hinweis:</b> Die Ränge sind aufsteigend sortiert. Um Fehler zu vermeiden, solltest du diese Reihenfolge einhalten.<br/> Du kannst Elemente durch ziehen neu anordnen!</p>

source: No exam results found!
de: Keine Prüfungsergebnisse gefunden!

source: This means that either you have not yet created an exam, or each participant already has their exam result.
de: Dies bedeutet, dass du entweder noch keine Prüfung erstellt hast, oder jeder Teilnehmer bereits sein Prüfungsergebnis hat.

source: <b>Hello, examiner! You can see your participants listed below.</b>
de: <b>Hallo, Prüfer! Ihre Teilnehmer sind unten aufgelistet.</b>

source: no min rank
de: Kein Mindestrang

source: Ranks:
de: Ränge:

source: Martial Art
de: Kampfkunst

source: Passed
de: Bestanden

source: <mat-icon>cloud_download</mat-icon> download
de: <mat-icon>cloud_download</mat-icon> herunterladen

source: <mat-icon>edit</mat-icon> Edit
de: <mat-icon>edit</mat-icon> Bearbeiten

source: Registration End Date:
de: Anmeldeschluss:

source: Exam Date:
de: Prüfungsdatum:

source: Address:
de: Anschrift:

source: Examiner:
de: Prüfer

source: Price:
de: Preis:

source: Minimum Rank:
de: Mindestrang:

source: <mat-icon>bookmark_border</mat-icon> Sign in
de: <mat-icon>bookmark_border</mat-icon> Anmelden

source: <mat-icon>bookmark</mat-icon> Sign out
de: <mat-icon>bookmark</mat-icon> Abmelden

source: Martial Art:
de: Kampfkunst:

source: <mat-icon>update</mat-icon> Update
de: <mat-icon>update</mat-icon> Aktualisieren

source: <mat-icon>delete</mat-icon> Delete
de: <mat-icon>delete</mat-icon> Löschen

source: <mat-icon>cancel</mat-icon> Cancel
de: <mat-icon>cancel</mat-icon> Abbrechen

source: <mat-icon>delete</mat-icon> Confirm Delete
de: <mat-icon>delete</mat-icon> Löschen Bestätigen

source: Login / Register
de: Login / Registrieren

source: Exam
de: Prüfung

source: Exam Result
de: Prüfungsergebnis

source: <mat-icon>send</mat-icon> Send
de: <mat-icon>send</mat-icon> Senden

source: <mat-icon>send</mat-icon> Create New Exam
de: <mat-icon>send</mat-icon> Neue Prüfung erstellen

source: <mat-icon>add</mat-icon> Add Ranks
de: <mat-icon>add</mat-icon> Rang Hinzufügen

source: <mat-icon>send</mat-icon> Create
de: <mat-icon>send</mat-icon> Erstellen

source: Select Theme
de: Theme auswählen

source: Light Theme
de: Helles Theme

source: Dark Theme
de: Dunkles Theme

source: * Required fields
de: * Pflichtfelder

source: Martial Art Name
de: Kampfkunst

source: The name of your martial art
de: Der Name deiner Kampfkunst

source: You must enter a valid name
de: Du musst einen gültigen Namen eingeben

source: Style Name
de: Stil Name

source: The style name of your martial art
de: Der Stil Name deiner Kampfkunst

source: You must enter a valid style name
de: Du musst einen gültigen Stil Namen eingeben

source: Description
de: Beschreibung

source: Describe this martial art!
de: Beschreibe diese Kampfkunst!

source: You must enter a valid description
de: Du musst eine gültige Beschreibung eingeben

source: User E-Mail Adress
de: Benutzer E-Mail Adresse

source: An E-Mail adress from an existing user account
de: E-Mail Adresse eines existierenden Benutzerkontos

source: You must enter a valid email adress
de: Du musst eine gültige E-Mail Adresse eingeben

source: First Name
de: Vorname

source: John
de: Max

source: Please enter your first name
de: Bitte gib deinen Vornamen ein

source: Last Name
de: Nachname

source: Doe
de: Mustermann

source: Please enter your last name
de: Bitte gib deinen Nachnamen ein

source: john.doe@provider.com
de: max.mustermann@provider.de

source: Your email adress
de: Deine E-Mail Adresse

source: Please enter your email adress
de: Bitte gib deine E-Mail Adresse ein

source: Your password
de: Dein Passwort

source: Please enter at least 5 characters. There is no max password length!
de: Bitte gib mindestens 5 Zeichen ein. Es gibt keine maximale Password Länge!

source: Your email
de: Deine E-Mail

source: You must enter a valid email
de: Du musst eine gültige E-Mail Adresse eingeben

source: Your current password
de: Dein aktuelles Passwort

source: You must enter your current password
de: Du musst dein aktuelles Passwort eingeben

source: Choose a new pasword, if you like
de: Wähle ein neues Passwort, wenn du möchtest

source: You must enter a password
de: Du musst ein Passwort eingeben

source: repeat new password
de: Neues Passwort Wiederholen

source: Repeat your new pasword
de: Wiederhole dein neues Passwort

source: The martial art for this exam
de: Die Kampfkunst dieser Prüfung

source: Please choose a martial art for this exam!
de: Bitte wähle die Kampfkunst für diese Prüfung!

source: Minimum Rank
de: Mindestrang

source: The minimum rank for this exam
de: Der Mindestrang für diese Prüfung

source: Please choose a minimum rank for this exam!
de: Bitte wähle einen Mindestrang für die Prüfung aus!

source: Exam Title
de: Prüfungstitel

source: The title of this exam
de: Der Titel der Prüfung

source: Please enter at least 5 characters!
de: Bitte gib mindestens 5 Zeichen ein!

source: Exam Address
de: Prüfungsanschrift

source: The address of this exam
de: Die Anschrift für diese Prüfung

source: Describe this exam!
de: Beschreibe diese Prüfung!

source: Please enter at least 5 characters.
de: Bitte gib mindestens 5 Zeichen ein!

source: Exam Date
de: Prüfungsdatum

source: The date when the exam should start
de: Das Datum, wann die Prüfung stattfinden soll

source: Please choose a date and time
de: Bitte wähle Datum und Uhrzeit

source: Registration End Date
de: Anmeldeschluss

source: The date when the registration should close
de: Das Datum, wann die Anmeldung geschlossen wird.

source: Price
de: Preis

source: How much does this exam cost?
de: Wieviel soll diese Prüfung kosten?

source: You must enter something. 0 would be ok.
de: Du musst etwas eingeben. 0 wäre ok.

source: Your exams
de: Deine Prüfungen

source: Show previous exams...
de: Zeige vorherige Prüfungen...

source: Last month
de: Letzter Monat

source: Last two months
de: Letzten zwei Monate

source: Last three months
de: Letzten drei Monate

source: Last four months
de: Letzten vier Monate

source: Last five months
de: Letzten fünf Monate

source: Last six months
de: Letzten sechs Monate

source: <mat-icon>edit</mat-icon> Edit
de: <mat-icon>edit</mat-icon> Bearbeiten

source: You have not yet taken any exams, nor have you created any.
de: Du hast bisher weder an Prüfungen teilgenommen, noch welche erstellt.

source: Feedback & Bug Report
de: Feedback & Fehlermeldungen

source: Do you want to send us some feedback or report an error?
de: Möchtest du uns etwas Feedback oder eine Fehlermeldung zukommen lassen?

source: {{login ? 'Login' : 'Create Account'}}
de: {{login ? 'Login' : 'Erstelle Konto'}}

source: {{login ? 'Need to create an account?' : 'Already have an account?'}}
de: {{login ? 'Konto erstellen?' : 'Konto vorhanden?'}}

source: Forgot password?
de: Passwort vergessen?

source: Password Reset
de: Passwort zurücksetzen

source: Repeat Password
de: Passwort wiederholen

source: Send
de: Senden

source: Success
de: Erfolg

source: New martial art was added to your profile!
de: Neue Kampfkunst wurde deinem Profil hinzugefügt!

source: Server Error
de: Serverfehler

source: An unexpected server error occured!
de: Es ist ein unerwarteter Serverfehler aufgetreten!

source: You have successfully registered for this exam
de: Du hast dich erfolgreich für diese Prüfung angemeldet

source: You have successfully logged out of this exam
de: Du hast dich erfolgreich von dieser Prüfung abgemeldet

source: Exam details have been updated
de: Prüfungsdetails wurden aktualisiert

source: Delete successfull!
de: Löschen erfolgreich!

source: Exam created!
de: Prüfung erstellt!

source: A new exam was created successfully.
de: Eine neue Prüfung wurde erfolgreich erstellt.

source: Could not create exam.
de: Prüfung konnte nicht erstellt werden.

source: User Error
de: Benutzerfehler

source: The form is not valid. Please fill out all required fields.
de: Das Formular ist ungültig. Bitte fülle alle erforderlichen Felder aus.

source: New martial art created!
de: Neue Kampfkunst erstellt!

source: Could not create martial art
de: Kampfkunst konnte nicht erstellt werden

source: Martial art updated!
de: Kampfkunst aktualisiert

source: Could not update martial art.
de: Kampfkunst konnte nicht aktualisiert werden

source: Could not load exam results
de: Prüfungsergebnisse konnten nicht geladen werden

source: Exam result created.
de: Prüfungsergebnis erstellt

source: Could not create exam result
de: Prüfungsergebnis konnte nicht erstellt werden

source: File Upload
de: Datei hochgeladen

source: Protocol upload finished.
de: Hochladen des Protokolls fertig

source: File upload failed.
de: Hochladen fehlgeschlagen

source: New examiner was added.
de: Neuer Prüfer hinzugefügt

source: Could not add examiner. Are you authorized?
de: Prüfer konnte nicht hinzugefügt werden. Bist du autorisiert?

source: Examiner removed.
de: Prüfer entfernt.

source: Could not remove examiner. Are you authorized?
de: Prüfer konnte nicht entfernt werden. Bist du autorisiert?

source: Invalid input!
de: Ungültige Eingabe!

source: You need to enter your new password twice!
de: Du musst dein neues Passwort zweimal eingeben!

source: Login failed!
de: Login Fehlgeschlagen!

source: Email or password incorrect!
de: E-Mail oder Passwort falsch!

source: Login failed, but we don't know why!
de: Login fehlgeschlagen, aber wir wissen nicht warum!

source: Your login was successfull!
de: Dein Login war erfolgreich!

source: Logout successfull.
de: Ausloggen erfolgreich.

source: Signup successfull!
de: Registrierung erfolgreich!

source: Please check your emails to complete signup!
de: Bitte prüfe deine E-Mails, um die Registrierung abzuschließen!

source: Passwort Reset
de: Passwort zurückgesetzt

source: An confirmation email will be send, if this account exists
de: Eine Bestätigungsemail wird versendet, sofern das Konto existiert.

source: Could not load exams.
de: Prüfungen konnten nicht geladen werden.

source: Could not load martial arts
de: Kampfkünste konnten nicht geladen werden.
